package org.example;

public class Main {
    public static void main(String[] args) {
        //В src/main создайте класс Cafe. Добавьте в него поля “время работы” (строка в формате 10:00 - 18:00),
        // “выходные дни” (список с порядковыми номерами дней недели, Пн - 1-ый день).
        // А также добавьте методы для:
        // a. Установки нового времени работы (на вход поступает только 2 числа,например, для формирования строки
        // 10:00 - 18:00",метод принимает только числа 10 и 18)
        // b.Добавления дней в список выходных.
        // Удаления дней из списка выходных
    }
}